//! PSYQ=3.3 CC1=2.6.3
#include "world.h"

typedef struct {
    /* 0x00 */ s32 unk0; // aligns with Unk8010AD3C->unkC
    /* 0x04 */ s32 unk4; // aligns with Unk8010AD3C->unk10
    /* 0x08 */ s32 unk8; // aligns with Unk8010AD3C->unk14
    /* 0x0C */ s32 unkC; // aligns with Unk8010AD3C->unk18
} Unk800AA098;

typedef struct {
    /* 0x00 */ s32 unk0;
    /* 0x04 */ s32 unk4;
    /* 0x08 */ s32 unk8;
    /* 0x0C */ s32 unkC;
    /* 0x10 */ s32 unk10;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ s32 unk20;
    /* 0x24 */ s32 unk24;
    /* 0x28 */ s32 unk28;
    /* 0x2C */ s32 unk2C;
    /* 0x30 */ s32 unk30;
    /* 0x34 */ s32 unk34;
    /* 0x38 */ s32 unk38;
    /* 0x3C */ s32 unk3C;
    /* 0x40 */ s32 unk40;
    /* 0x44 */ s32 unk44;
    /* 0x48 */ s16 unk48;
    /* 0x4A */ s16 unk4A;
    /* 0x4C */ s16 unk4C;
    /* 0x4E */ s16 unk4E;
    /* 0x50 */ s32 unk50;
    /* 0x54 */ s32 unk54;
    /* 0x58 */ s32 unk58;
    /* 0x5C */ s8 unk5C;
    /* 0x5D */ s8 unk5D;
} Unk8010AD3C; // size:???

typedef struct {
    /* 0x00 */ s32 unk0;
    /* 0x04 */ s32 unk4;
    /* 0x08 */ s32 unk8;
    /* 0x0C */ s32 unkC;
    /* 0x10 */ s32 unk10;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ s32 unk20;
    /* 0x24 */ s32 unk24;
    /* 0x28 */ s32 unk28;
    /* 0x2C */ s32 unk2C;
    /* 0x30 */ s32 unk30;
    /* 0x34 */ s32 unk34;
    /* 0x38 */ s32 unk38;
    /* 0x3C */ s32 unk3C;
    /* 0x40 */ s32 unk40;
    /* 0x44 */ s32 unk44;
    /* 0x48 */ s16 unk48;
    /* 0x4A */ s16 unk4A;
    /* 0x4C */ s16 unk4C;
    /* 0x4E */ s16 unk4E;
    /* 0x50 */ s8 unk50;
} Unk8010AD40; // size:???

typedef struct {
    /* 0x00 */ s32 unk0;
    /* 0x04 */ s32 unk4;
    /* 0x08 */ s32 unk8;
    /* 0x0C */ s32 unkC;
    /* 0x10 */ s32 unk10;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 unk18;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ s32 unk20;
} Unk8010B3B8; // size:???

void func_800A31C0(s16);
void func_800A368C(s32);
void func_800A6994(s32*, s32);
void func_800A8CE4();
void func_800A8F74();
void func_800A8FCC();
void func_800A9110();
s32 func_800A9154();
s32 func_800A9174();
s32 func_800A929C();
s16 func_800A97A8(void);
void func_800A98A4(s32);
s32 func_800A98E4(void);
s32 func_800A99BC();
s32 func_800A9A44(void);
void func_800AB8EC(s32);
void func_800ABA18(s32);
void func_800B5274();
void func_800B63F0(s32);
void func_800B65E0(s32);
s32 func_800B7200();
void func_800BB9A0(u8);
static void func_800BBA5C(void);
s32 func_800BBBB0(void);

extern s32 D_800D05E8;
extern s32 D_800E5608;
extern s32 D_800E560C;
extern s32 D_800E5618;
extern s32 D_800E5628;
extern s32 D_800E5630;
extern s32 D_800E5634;
extern s32 D_800E5648;
extern s32 D_800E5654;
extern s32 D_800E5678;
extern MATRIX D_800E5698;
extern MATRIX D_800E56B8;
extern s32 D_800E5828;
extern s32 D_800E55EC;
extern s32 D_800E55FC;
